[
    {
        "vehicleName" : "Falcon 9",
        "description" : ["The Falcon 9, created by SpaceX, is a groundbreaking rocket that has revolutionized the space industry. This two-stage rocket is powered by Merlin engines and has achieved several historic milestones, including being the first privately-developed spacecraft to reach orbit. Its innovative design includes the ability to vertically land and be reused, drastically reducing the cost of space travel.", "One of the Falcon 9's standout achievements is its role in launching astronauts to the International Space Station (ISS). Through the Crew Dragon spacecraft, the Falcon 9 has become a key player in NASA's Commercial Crew Program, enabling safe and reliable transport of astronauts to and from the ISS. This marks a significant step forward in commercializing human spaceflight.", "Furthermore, the Falcon 9 has played a pivotal role in the deployment of countless satellites, offering a reliable and cost-effective means for space access. Its impressive track record and continuous improvements underscore its significance in shaping the future of space exploration and transportation, solidifying SpaceX's position as a leader in the space industry."],
        "vehicleVariants" :
        [
            {
                "variantName" : "Block 1",
                "altVariantName" : "v1.0",
                "vehicleHeight" : 54.9,
                "vehicleDiameter" : 3.66,
                "fairingHeight" : 13.0,
                "fairingDiameter" : 5.2,
                "manufacturer" : "SpaceX",
                "numberOfStages" : 2,
                "strapOnBoosters" : 0,
                "priceTag" : "59500000",
                "thrustAtLiftOff" : 4940,
                "status" : "Retired",
            },
            {
                "variantName" : "Block 2",
                "altVariantName" : "v1.1",
                "vehicleHeight" : 68.4,
                "vehicleDiameter" : 3.66,
                "fairingHeight" : 13.0,
                "fairingDiameter" : 5.2,
                "manufacturer" : "SpaceX",
                "numberOfStages" : 2,
                "strapOnBoosters" : 0,
                "priceTag" : "56500000",
                "thrustAtLiftOff" : 5885,
                "status" : "Retired",
            },
            {
                "variantName" : "Block 3",
                "altVariantName" : "v1.2/FT",
                "vehicleHeight" : 70.0,
                "vehicleDiameter" : 3.66,
                "fairingHeight" : 13.0,
                "fairingDiameter" : 5.2,
                "manufacturer" : "SpaceX",
                "numberOfStages" : 2,
                "strapOnBoosters" : 0,
                "priceTag" : "62000000",
                "thrustAtLiftOff" : 6804,
                "status" : "Retired",
            },
            {
                "variantName" : "Block 4",
                "altVariantName" : "",
                "vehicleHeight" : 70.0,
                "vehicleDiameter" : 3.66,
                "fairingHeight" : 13.0,
                "fairingDiameter" : 5.2,
                "manufacturer" : "SpaceX",
                "numberOfStages" : 2,
                "strapOnBoosters" : 0,
                "priceTag" : "62000000",
                "thrustAtLiftOff" : 6804,
                "status" : "Retired",
            },
            {
                "variantName" : "Block 5",
                "altVariantName" : "",
                "vehicleHeight" : 70.0,
                "vehicleDiameter" : 3.66,
                "fairingHeight" : 13.0,
                "fairingDiameter" : 5.2,
                "manufacturer" : "SpaceX",
                "numberOfStages" : 2,
                "strapOnBoosters" : 0,
                "priceTag" : "67000000",
                "thrustAtLiftOff" : 7607,
                "status" : "Active",
            },
        ]
    },
    {
        "vehicleName" : "Falcon Heavy",
        "description" : ["The Falcon Heavy, another remarkable creation by SpaceX, is one of the most powerful operational rockets in the world today. It's essentially an upgraded version of the Falcon 9, with three Falcon 9 first-stage cores working in unison. This tri-core configuration allows the Falcon Heavy to carry heavy payloads into space, making it an ideal choice for missions to deep space and beyond.", "The maiden flight of the Falcon Heavy in 2018 captured global attention, as it demonstrated SpaceX's commitment to pushing the boundaries of space exploration. Notable payloads included Elon Musk's own Tesla Roadster, serving as a testament to the rocket's capabilities. With a payload capacity exceeding 140,000 pounds to low Earth orbit, the Falcon Heavy has opened up new possibilities for missions to the Moon, Mars, and even interplanetary exploration.", "Its ability to launch massive payloads while retaining the reusability feature of the Falcon 9 has made the Falcon Heavy a game-changer in the commercial space industry. It offers a cost-effective option for a wide range of missions, from deploying large satellite constellations to supporting ambitious scientific endeavors, further establishing SpaceX as a driving force in modern space exploration."],
        "vehicleVariants" :
        [
            {
                "variantName" : "",
                "altVariantName" : "",
                "vehicleHeight" : 70.0,
                "vehicleDiameter" : 3.66,
                "fairingHeight" : 13.0,
                "fairingDiameter" : 5.2,
                "manufacturer" : "SpaceX",
                "numberOfStages" : 2,
                "strapOnBoosters" : 2,
                "priceTag" : "97000000",
                "thrustAtLiftOff" : 22819,
                "status" : "Active",
            },
        ]
    },
]
